requests/SearchByArea.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="com.thelateroomsgroup.services.search" xmlns:fil="com.thelateroomsgroup.services.search/Filters" xmlns:arr="http://schemas.microsoft.com/2003/10/Serialization/Arrays">
   <soapenv:Header/>
   <soapenv:Body>
      <com:SearchByArea>
         <com:request>
            <com:AreaId>{{aid:100}}</com:AreaId>
            <com:ArrivalDate>{{arrivalDate:$TODAY$}}</com:ArrivalDate>
            <com:CurrencyCode>{{currencyCode:GBP}}</com:CurrencyCode>
            <com:Filters>
               <fil:ExcludeFullHotels>true</fil:ExcludeFullHotels>
            </com:Filters>
            <com:Nights>{{nights:1}}</com:Nights>
            <com:Occupancy>
               <com:Adults>{{adults:2}}</com:Adults>
               <com:Children>{{children:0}}</com:Children>
            </com:Occupancy>
         </com:request>
      </com:SearchByArea>
   </soapenv:Body>
</soapenv:Envelope>
